#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
. relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/personal-website-iac/personal-website-iac/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/personal-website-iac/personal-website-iac

To view this run in a browser, visit:
https://app.terraform.io/app/hechaorganization/personal-website-infra/runs/run-9wvSYa3xBg8NkSQw

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
module.iam.aws_iam_user.github_actions: Refreshing state... [id=github-actions-personal-website-prod]
module.infrastructure.aws_s3_bucket.website: Refreshing state... [id=personal-website-ciarcia]
module.infrastructure.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=personal-website-ciarcia]
module.infrastructure.aws_s3_bucket_website_configuration.bucket_website: Refreshing state... [id=personal-website-ciarcia]
module.infrastructure.aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=personal-website-ciarcia,public-read]
module.infrastructure.module.cdn_website.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E3RFI1R5900MXJ]
module.iam.aws_iam_policy.github_actions_policy: Refreshing state... [id=arn:aws:iam::860443674636:policy/personal-website-prod-github-actions-policy]
module.infrastructure.aws_route53_record.AAAA_record: Refreshing state... [id=Z04217553VJM3IP6I6W8T_ettoreciarcia.com_AAAA]
module.infrastructure.aws_route53_record.A_record: Refreshing state... [id=Z04217553VJM3IP6I6W8T_ettoreciarcia.com_A]
module.iam.aws_iam_user_policy_attachment.github_actions_policy_attachment: Refreshing state... [id=github-actions-personal-website-prod-20230106134754775600000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.aws_s3_bucket.test-github_actions will be created
  + resource "aws_s3_bucket" "test-github_actions" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "asssslksdnflaksn-ciarcia"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Application" = "personal-website"
          + "Environment" = "prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @ettoreciarcia, Action: `pull_request`*